The  DocumentReloadLatestProgessChangedEventArgs  type exposes the following members.
 Methods
Name  |   Description
Dispose   |   (Inherited from  RevitAPIEventArgs  .)
Equals
 Determines whether the specified  Object  is equal to the current  Object  .
 (Inherited from  Object  .)
GetHashCode
 Serves as a hash function for a particular type.
 (Inherited from  Object  .)
GetType
 Gets the  Type  of the current instance.
 (Inherited from  Object  .)
IsCancelled
 Indicates whether the event is being cancelled.
 (Inherited from  RevitAPIEventArgs  .)
ToString
 Returns a string that represents the current object.
 (Inherited from  Object  .)
 Properties
Name  |   Description
Cancellable
 Indicates whether an event may be cancelled by an event delegate.
 (Inherited from  RevitAPIEventArgs  .)
FinishedSize
 The transferred data size, in bytes, since the last time this event was raised.
 (Inherited from  DataTransferProgressChangedEventArgs  .)
IsMerging
 Indicates if it is merging downloaded data.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from  RevitAPIEventArgs  .)
Location
 Full path of the central model which is to be operated.
 (Inherited from  WorksharedOperationProgressChangedEventArgs  .)
ReloadLatestFinished
 Indicates if current 'reload latest' progress is finished or not.
RetryTimes
 The number of times Revit has tried to Reload Latest. Its value is '0' at the first time.
Speed
 Speed(bytes/second) in this event.
 (Inherited from  DataTransferProgressChangedEventArgs  .)
Status
 Get API event status, reflect current operation execution status.
 (Inherited from  WorksharedOperationProgressChangedEventArgs  .)
TotalSize
 Total expected data size to transfer, in bytes.
 (Inherited from  DataTransferProgressChangedEventArgs  .)
TransferMode
 Data transfer mode in this event.
 (Inherited from  DataTransferProgressChangedEventArgs  .)
 See Also
  DocumentReloadLatestProgessChangedEventArgs Class
  Autodesk.Revit.DB.Events Namespace